<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Import-libraries" data-toc-modified-id="Import-libraries-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import libraries</a></span></li><li><span><a href="#General-info" data-toc-modified-id="General-info-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>General info</a></span></li><li><span><a href="#Load-data-and-cleaning" data-toc-modified-id="Load-data-and-cleaning-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Load data and cleaning</a></span></li><li><span><a href="#Visualization" data-toc-modified-id="Visualization-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Visualization</a></span></li></ul></div>

# Import libraries

In [2]:
import sys
sys.path.append('../')

import pandas as pd
import src.cleaning as cl

# General info

The CO₂ gives us the average CO₂ emissions (in metric tons) per person. The dataset is divided up by countries and other categories such as ‘World’ or ‘Upper middle income’, in this tutorial we are only interested in ‘World’ as we are looking at things on a global scale.

For more info [here](https://data.worldbank.org/indicator/EN.ATM.CO2E.PC)

https://towardsdatascience.com/time-series-analysis-and-climate-change-7bb4371021e

# Load data and cleaning

In [3]:
df_1 = pd.read_csv("../Data/co2.csv", sep=';')
df_1.head(1)

,Data Source,World Development Indicators,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 54,Unnamed: 55,Unnamed: 56,Unnamed: 57,Unnamed: 58,Unnamed: 59,Unnamed: 60,Unnamed: 61,Unnamed: 62,Unnamed: 63
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df_1 = cl.cleaning_co2_data(df_1)
df_1.head(1)

,Country Name,Country Code,1960,1961,1962,1963,1964,1965,1966,1967,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014
4,Aruba,ABW,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,27.200708,26.94826,27.895574,26.230847,25.915833,24.670529,24.505835,13.155542,8.351294,8.408363

In [5]:
df_1.to_csv("../Data/co2_def.csv")

# Visualization